cozycactus/sdr-widget/ports/same70-xplained/same70_usb.c
#include "same70_usb.h"

#define REG32(addr) (*(volatile uint32_t *)(addr))

#define PMC_SCER   REG32(0x400E0600u)
#define CKGR_UCKR  REG32(0x400E061Cu)
#define PMC_USB    REG32(0x400E0638u)
#define PMC_SR     REG32(0x400E0668u)
#define PMC_PCER1  REG32(0x400E0700u)
#define PMC_PCSR1  REG32(0x400E0708u)

#define CKGR_UCKR_UPLLEN       (1u << 16)
#define CKGR_UCKR_UPLLCOUNT(x) ((x) << 20)
#define PMC_USB_USBS_UPLL      (1u << 0)
#define PMC_USB_USBDIV(x)      ((x) << 8)
#define PMC_SCER_USBCLK        (1u << 5)
#define PMC_SR_LOCKU           (1u << 6)

#define USBHS_BASE     0x40038000u
#define USBHS_DEVCTRL  REG32(USBHS_BASE + 0x000u)
#define USBHS_DEVISR   REG32(USBHS_BASE + 0x004u)
#define USBHS_DEVICR   REG32(USBHS_BASE + 0x008u)
#define USBHS_DEVIDR   REG32(USBHS_BASE + 0x014u)
#define USBHS_DEVIER   REG32(USBHS_BASE + 0x018u)
#define USBHS_DEVEPT   REG32(USBHS_BASE + 0x01Cu)
#define USBHS_CTRL     REG32(USBHS_BASE + 0x800u)
#define USBHS_SR       REG32(USBHS_BASE + 0x804u)

#define USBHS_DEVEPTCFG(ep) REG32(USBHS_BASE + 0x100u + ((ep) * 4u))
#define USBHS_DEVEPTISR(ep) REG32(USBHS_BASE + 0x130u + ((ep) * 4u))
#define USBHS_DEVEPTICR(ep) REG32(USBHS_BASE + 0x160u + ((ep) * 4u))
#define USBHS_DEVEPTIMR(ep) REG32(USBHS_BASE + 0x1C0u + ((ep) * 4u))
#define USBHS_DEVEPTIER(ep) REG32(USBHS_BASE + 0x1F0u + ((ep) * 4u))
#define USBHS_DEVEPTIDR(ep) REG32(USBHS_BASE + 0x220u + ((ep) * 4u))

#define USBHS_RAM_ADDR 0xA0100000u
#define USBHS_EP_FIFO(ep) ((volatile uint8_t *)(USBHS_RAM_ADDR + ((ep) * 0x8000u)))

#define SCB_AIRCR              REG32(0xE000ED0Cu)
#define SCB_AIRCR_VECTKEY      (0x5fau << 16)
#define SCB_AIRCR_PRIGROUP_Msk (7u << 8)
#define SCB_AIRCR_SYSRESETREQ  (1u << 2)

#define ID_USBHS               34u
#define USBHS_PCER1_BIT        (1u << (ID_USBHS - 32u))

#define USBHS_CTRL_FRZCLK      (1u << 14)
#define USBHS_CTRL_USBE        (1u << 15)
#define USBHS_CTRL_VBUSHWC     (1u << 8)
#define USBHS_CTRL_UIMOD_DEV   (1u << 25)
#define USBHS_SR_CLKUSABLE     (1u << 14)

#define USBHS_DEVCTRL_UADD_MASK 0x7fu
#define USBHS_DEVCTRL_ADDEN    (1u << 7)
#define USBHS_DEVCTRL_DETACH   (1u << 8)
#define USBHS_DEVCTRL_NORMAL   (0u << 10)
#define USBHS_DEVCTRL_FORCED_FS (3u << 10)

#define USBHS_DEVISR_EORST     (1u << 3)
#define USBHS_DEVICR_EORSTC    (1u << 3)
#define USBHS_DEVIDR_ALL       0xfe3ff07fu
#define USBHS_DEVIER_EORSTES   (1u << 3)
#define USBHS_DEVIER_PEP0      (1u << 12)

#define USBHS_DEVEPT_EPEN(ep)  (1u << (ep))
#define USBHS_DEVEPT_EPRST(ep) (1u << (16u + (ep)))
#define USBHS_DEVEPT_EPEN0     USBHS_DEVEPT_EPEN(0u)
#define USBHS_DEVEPT_EPRST0    USBHS_DEVEPT_EPRST(0u)
#define USBHS_DEVEPTCFG_ALLOC  (1u << 1)
#define USBHS_DEVEPTCFG_1_BANK (0u << 2)
#define USBHS_DEVEPTCFG_2_BANK (1u << 2)
#define USBHS_DEVEPTCFG_8B     (0u << 4)
#define USBHS_DEVEPTCFG_64B    (3u << 4)
#define USBHS_DEVEPTCFG_512B   (6u << 4)
#define USBHS_DEVEPTCFG_IN     (1u << 8)
#define USBHS_DEVEPTCFG_CTRL   (0u << 11)
#define USBHS_DEVEPTCFG_ISO    (1u << 11)

#define USBHS_DEVEPTISR_TXINI  (1u << 0)
#define USBHS_DEVEPTISR_RXOUTI (1u << 1)
#define USBHS_DEVEPTISR_RXSTPI (1u << 2)
#define USBHS_DEVEPTISR_UNDERFI (1u << 2)
#define USBHS_DEVEPTISR_HBISOINERRI (1u << 3)
#define USBHS_DEVEPTISR_HBISOFLUSHI (1u << 4)
#define USBHS_DEVEPTISR_OVERFI (1u << 5)
#define USBHS_DEVEPTISR_CRCERRI (1u << 6)
#define USBHS_DEVEPTISR_SHORTPACKETI (1u << 7)
#define USBHS_DEVEPTISR_ERRORTRANS (1u << 10)
#define USBHS_DEVEPTISR_NBUSYBK_MASK (3u << 12)
#define USBHS_DEVEPTISR_NBUSYBK_SHIFT 12u
#define USBHS_DEVEPTISR_RWALL (1u << 16)
#define USBHS_DEVEPTISR_BYCT_MASK (0x7ffu << 20)
#define USBHS_DEVEPTISR_BYCT_SHIFT 20u
#define USBHS_DEVEPTISR_CFGOK  (1u << 18)

#define USBHS_DEVEPTICR_TXINIC  (1u << 0)
#define USBHS_DEVEPTICR_RXOUTIC (1u << 1)
#define USBHS_DEVEPTICR_RXSTPIC (1u << 2)
#define USBHS_DEVEPTICR_UNDERFIC (1u << 2)
#define USBHS_DEVEPTICR_HBISOINERRIC (1u << 3)
#define USBHS_DEVEPTICR_HBISOFLUSHIC (1u << 4)
#define USBHS_DEVEPTICR_OVERFIC (1u << 5)
#define USBHS_DEVEPTICR_CRCERRIC (1u << 6)
#define USBHS_DEVEPTICR_SHORTPACKETIC (1u << 7)

#define USBHS_DEVEPTIER_RXSTPES  (1u << 2)
#define USBHS_DEVEPTIER_RXOUTES  (1u << 1)
#define USBHS_DEVEPTIER_RSTDTS   (1u << 18)
#define USBHS_DEVEPTIER_STALLRQS (1u << 19)

#define USBHS_DEVEPTIDR_FIFOCONC (1u << 14)
#define USBHS_DEVEPTIDR_STALLRQC (1u << 19)

#define USB_REQ_GET_STATUS        0u
#define USB_REQ_CLEAR_FEATURE     1u
#define USB_REQ_SET_ADDRESS       5u
#define USB_REQ_GET_DESCRIPTOR    6u
#define USB_REQ_GET_CONFIGURATION 8u
#define USB_REQ_SET_CONFIGURATION 9u
#define USB_REQ_GET_INTERFACE     10u
#define USB_REQ_SET_INTERFACE     11u

#define AUDIO_REQ_SET_CUR         0x01u
#define AUDIO_REQ_GET_CUR         0x81u
#define AUDIO_REQ_GET_MIN         0x82u
#define AUDIO_REQ_GET_MAX         0x83u
#define AUDIO_REQ_GET_RES         0x84u

#define AUDIO_CONTROL_MUTE        0x01u
#define AUDIO_CONTROL_VOLUME      0x02u
#define AUDIO_CONTROL_SAMPLE_FREQ 0x01u
#define AUDIO_MIC_FEATURE_UNIT    0x02u
#define AUDIO_SPK_FEATURE_UNIT    0x12u

#define WIDGET_REQ_RESET          0x0fu

#define FEATURE_DG8SAQ_COMMAND    0x71u
#define FEATURE_DG8SAQ_SET_NVRAM  3u
#define FEATURE_DG8SAQ_GET_NVRAM  4u
#define FEATURE_DG8SAQ_SET_RAM    5u
#define FEATURE_DG8SAQ_GET_RAM    6u
#define FEATURE_DG8SAQ_GET_INDEX  7u
#define FEATURE_DG8SAQ_GET_VALUE  8u
#define FEATURE_DG8SAQ_GET_DEFAULT 9u

#define FEATURE_MAJOR_INDEX       0u
#define FEATURE_MINOR_INDEX       1u
#define FEATURE_BOARD_INDEX       2u
#define FEATURE_END_INDEX         10u
#define FEATURE_END_VALUES        37u

#define FEATURE_BOARD_WIDGET      1u
#define FEATURE_IMAGE_UAC1_DG8SAQ 8u
#define FEATURE_IN_NORMAL         14u
#define FEATURE_OUT_NORMAL        17u
#define FEATURE_ADC_AK5394A       21u
#define FEATURE_DAC_CS4344        24u
#define FEATURE_LCD_HD44780       28u
#define FEATURE_LOG_500MS         33u

#define USB_DESC_DEVICE        1u
#define USB_DESC_CONFIGURATION 2u
#define USB_DESC_STRING        3u
#define USB_DESC_INTERFACE     4u
#define USB_DESC_DEVICE_QUAL   6u
#define USB_DESC_OTHER_SPEED   7u

#define EP0_SIZE 64u
#define USB_INTERFACE_COUNT 4u
#define USB_AUDIO_OUT_EP 3u
#define USB_AUDIO_FB_EP  4u
#define USB_AUDIO_IN_EP  5u
#define AUDIO_OUT_48K24_MAX_BYTES 294u
#define AUDIO_OUT_44K16_MAX_BYTES 180u
#define AUDIO_IN_48K24_PACKET_BYTES 288u
#define AUDIO_44K16_FRAME_BYTES 4u
#define AUDIO_44K16_FRAMES_PER_10MS 441u
#define AUDIO_44K16_PACKET_DIVISOR 10u
#define AUDIO_LOOPBACK_BUFFER_BYTES 8192u

