cozycactus/sdr-widget/ports/same70-xplained/same70_usb.c
typedef enum {
	EP0_STATE_IDLE = 0,
	EP0_STATE_TX_DATA = 1,
	EP0_STATE_TX_STATUS = 2,
	EP0_STATE_WAIT_OUT_STATUS = 3,
	EP0_STATE_RX_DATA_STATUS = 4
} ep0_state_t;

typedef struct {
	uint8_t bm_request_type;
	uint8_t request;
	uint16_t value;
	uint16_t index;
	uint16_t length;
} usb_setup_t;

static const uint8_t device_descriptor[] = {
	18, USB_DESC_DEVICE,
	0x00, 0x02,
	0xef, 0x02, 0x01,
	EP0_SIZE,
	0xc0, 0x16,
	0xdc, 0x05,
	0x00, 0x10,
	1, 2, 3,
	1
};

static const uint8_t configuration_descriptor[] = {
	0x09, 0x02, 0x41, 0x01, 0x04, 0x01, 0x00, 0xc0, 0xfa,
	0x09, 0x04, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
	0x08, 0x0b, 0x01, 0x03, 0x01, 0x01, 0x00, 0x00,
	0x09, 0x04, 0x01, 0x00, 0x00, 0x01, 0x01, 0x00, 0x00,
	0x0a, 0x24, 0x01, 0x00, 0x01, 0x4e, 0x00, 0x02, 0x02, 0x03,
	0x0c, 0x24, 0x02, 0x01, 0x01, 0x02, 0x00, 0x02, 0x03, 0x00, 0x00, 0x00,
	0x0d, 0x24, 0x06, 0x02, 0x01, 0x02, 0x01, 0x00, 0x02, 0x00, 0x02, 0x00, 0x00,
	0x09, 0x24, 0x03, 0x03, 0x01, 0x01, 0x00, 0x02, 0x00,
	0x0c, 0x24, 0x02, 0x11, 0x01, 0x01, 0x00, 0x02, 0x03, 0x00, 0x00, 0x00,
	0x0d, 0x24, 0x06, 0x12, 0x11, 0x02, 0x01, 0x00, 0x02, 0x00, 0x02, 0x00, 0x00,
	0x09, 0x24, 0x03, 0x13, 0x02, 0x03, 0x00, 0x12, 0x00,
	0x09, 0x04, 0x02, 0x00, 0x00, 0x01, 0x02, 0x00, 0x00,
	0x09, 0x04, 0x02, 0x01, 0x02, 0x01, 0x02, 0x00, 0x00,
	0x07, 0x24, 0x01, 0x11, 0x04, 0x01, 0x00,
	0x0b, 0x24, 0x02, 0x01, 0x02, 0x03, 0x18, 0x01, 0x80, 0xbb, 0x00,
	0x09, 0x05, 0x03, 0x05, 0x26, 0x01, 0x04, 0x04, 0x84,
	0x07, 0x25, 0x01, 0x01, 0x00, 0x00, 0x00,
	0x09, 0x05, 0x84, 0x11, 0x04, 0x00, 0x04, 0x05, 0x00,
	0x09, 0x04, 0x02, 0x02, 0x02, 0x01, 0x02, 0x00, 0x00,
	0x07, 0x24, 0x01, 0x11, 0x04, 0x01, 0x00,
	0x0b, 0x24, 0x02, 0x01, 0x02, 0x02, 0x10, 0x01, 0x44, 0xac, 0x00,
	0x09, 0x05, 0x03, 0x05, 0xb4, 0x00, 0x04, 0x04, 0x84,
	0x07, 0x25, 0x01, 0x01, 0x00, 0x00, 0x00,
	0x09, 0x05, 0x84, 0x11, 0x04, 0x00, 0x04, 0x05, 0x00,
	0x09, 0x04, 0x03, 0x00, 0x00, 0x01, 0x02, 0x00, 0x00,
	0x09, 0x04, 0x03, 0x01, 0x01, 0x01, 0x02, 0x00, 0x00,
	0x07, 0x24, 0x01, 0x03, 0x01, 0x01, 0x00,
	0x0b, 0x24, 0x02, 0x01, 0x02, 0x03, 0x18, 0x01, 0x80, 0xbb, 0x00,
	0x09, 0x05, 0x85, 0x25, 0x26, 0x01, 0x04, 0x00, 0x00,
	0x07, 0x25, 0x01, 0x01, 0x00, 0x00, 0x00,
	0x09, 0x04, 0x03, 0x02, 0x01, 0x01, 0x02, 0x00, 0x00,
	0x07, 0x24, 0x01, 0x03, 0x01, 0x01, 0x00,
	0x0b, 0x24, 0x02, 0x01, 0x02, 0x02, 0x10, 0x01, 0x44, 0xac, 0x00,
	0x09, 0x05, 0x85, 0x25, 0xb4, 0x00, 0x04, 0x00, 0x00,
	0x07, 0x25, 0x01, 0x01, 0x00, 0x00, 0x00
};

static const uint8_t other_speed_configuration_descriptor[] = {
	0x09, 0x07, 0x41, 0x01, 0x04, 0x01, 0x00, 0xc0, 0xfa,
	0x09, 0x04, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
	0x08, 0x0b, 0x01, 0x03, 0x01, 0x01, 0x00, 0x00,
	0x09, 0x04, 0x01, 0x00, 0x00, 0x01, 0x01, 0x00, 0x00,
	0x0a, 0x24, 0x01, 0x00, 0x01, 0x4e, 0x00, 0x02, 0x02, 0x03,
	0x0c, 0x24, 0x02, 0x01, 0x01, 0x02, 0x00, 0x02, 0x03, 0x00, 0x00, 0x00,
	0x0d, 0x24, 0x06, 0x02, 0x01, 0x02, 0x01, 0x00, 0x02, 0x00, 0x02, 0x00, 0x00,
	0x09, 0x24, 0x03, 0x03, 0x01, 0x01, 0x00, 0x02, 0x00,
	0x0c, 0x24, 0x02, 0x11, 0x01, 0x01, 0x00, 0x02, 0x03, 0x00, 0x00, 0x00,
	0x0d, 0x24, 0x06, 0x12, 0x11, 0x02, 0x01, 0x00, 0x02, 0x00, 0x02, 0x00, 0x00,
	0x09, 0x24, 0x03, 0x13, 0x02, 0x03, 0x00, 0x12, 0x00,
	0x09, 0x04, 0x02, 0x00, 0x00, 0x01, 0x02, 0x00, 0x00,
	0x09, 0x04, 0x02, 0x01, 0x02, 0x01, 0x02, 0x00, 0x00,
	0x07, 0x24, 0x01, 0x11, 0x04, 0x01, 0x00,
	0x0b, 0x24, 0x02, 0x01, 0x02, 0x03, 0x18, 0x01, 0x80, 0xbb, 0x00,
	0x09, 0x05, 0x03, 0x05, 0x26, 0x01, 0x01, 0x01, 0x84,
	0x07, 0x25, 0x01, 0x01, 0x00, 0x00, 0x00,
	0x09, 0x05, 0x84, 0x11, 0x03, 0x00, 0x01, 0x05, 0x00,
	0x09, 0x04, 0x02, 0x02, 0x02, 0x01, 0x02, 0x00, 0x00,
	0x07, 0x24, 0x01, 0x11, 0x04, 0x01, 0x00,
	0x0b, 0x24, 0x02, 0x01, 0x02, 0x02, 0x10, 0x01, 0x44, 0xac, 0x00,
	0x09, 0x05, 0x03, 0x05, 0xb4, 0x00, 0x01, 0x01, 0x84,
	0x07, 0x25, 0x01, 0x01, 0x00, 0x00, 0x00,
	0x09, 0x05, 0x84, 0x11, 0x03, 0x00, 0x01, 0x05, 0x00,
	0x09, 0x04, 0x03, 0x00, 0x00, 0x01, 0x02, 0x00, 0x00,
	0x09, 0x04, 0x03, 0x01, 0x01, 0x01, 0x02, 0x00, 0x00,
	0x07, 0x24, 0x01, 0x03, 0x01, 0x01, 0x00,
	0x0b, 0x24, 0x02, 0x01, 0x02, 0x03, 0x18, 0x01, 0x80, 0xbb, 0x00,
	0x09, 0x05, 0x85, 0x25, 0x26, 0x01, 0x01, 0x00, 0x00,
	0x07, 0x25, 0x01, 0x01, 0x00, 0x00, 0x00,
	0x09, 0x04, 0x03, 0x02, 0x01, 0x01, 0x02, 0x00, 0x00,
	0x07, 0x24, 0x01, 0x03, 0x01, 0x01, 0x00,
	0x0b, 0x24, 0x02, 0x01, 0x02, 0x02, 0x10, 0x01, 0x44, 0xac, 0x00,
	0x09, 0x05, 0x85, 0x25, 0xb4, 0x00, 0x01, 0x00, 0x00,
	0x07, 0x25, 0x01, 0x01, 0x00, 0x00, 0x00
};

static const uint8_t device_qualifier_descriptor[] = {
	10, USB_DESC_DEVICE_QUAL,
	0x00, 0x02,
	0xef, 0x02, 0x01,
	EP0_SIZE,
	1,
	0
};

static const uint8_t string0_descriptor[] = {
	4, USB_DESC_STRING,
	0x09, 0x04
};

static const uint8_t manufacturer_string_descriptor[] = {
	22, USB_DESC_STRING,
	'S', 0, 'D', 0, 'R', 0, '-', 0, 'W', 0,
	'i', 0, 'd', 0, 'g', 0, 'e', 0, 't', 0
};

static const uint8_t product_string_descriptor[] = {
	40, USB_DESC_STRING,
	'Y', 0, 'o', 0, 'y', 0, 'o', 0, 'd', 0,
	'y', 0, 'n', 0, 'e', 0, ' ', 0, 'S', 0,
	'D', 0, 'R', 0, '-', 0, 'W', 0, 'i', 0,
	'd', 0, 'g', 0, 'e', 0, 't', 0
};

static const uint8_t serial_string_descriptor[] = {
	28, USB_DESC_STRING,
	'1', 0, '.', 0, '0', 0, '.', 0, '0', 0,
	'.', 0, '0', 0, '.', 0, '0', 0, '.', 0,
	'0', 0, '.', 0, '0', 0
};

static const uint8_t status_self_powered[] = { 1, 0 };
static const uint8_t status_zero[] = { 0, 0 };
static const uint8_t one_byte_zero[] = { 0 };

static const char * const feature_index_names[] = {
	"major",
	"minor",
	"board",
	"image",
	"in",
	"out",
	"adc",
	"dac",
	"lcd",
	"log",
	"end"
};

static const char * const feature_value_names[] = {
	"none",
	"widget",
	"usbi2s",
	"usbdac",
	"test",
	"end",
	"flashyblinky",
	"uac1_audio",
	"uac1_dg8saq",
	"uac2_audio",
	"uac2_dg8saq",
	"hpsdr",
	"test",
	"end",
	"normal",
	"swapped",
	"end",
	"normal",
	"swapped",
	"end",
	"none",
	"ak5394a",
	"end",
	"none",
	"cs4344",
	"es9022",
	"end",
	"none",
	"hd44780",
	"ks0073",
	"end",
	"none",
	"250ms",
	"500ms",
	"1sec",
	"2sec",
	"end",
	"end"
};

static const uint8_t feature_defaults[FEATURE_END_INDEX] = {
	FEATURE_END_INDEX,
	FEATURE_END_VALUES,
	FEATURE_BOARD_WIDGET,
	FEATURE_IMAGE_UAC1_DG8SAQ,
	FEATURE_IN_NORMAL,
	FEATURE_OUT_NORMAL,
	FEATURE_ADC_AK5394A,
	FEATURE_DAC_CS4344,
	FEATURE_LCD_HD44780,
	FEATURE_LOG_500MS
};

static uint8_t feature_nvram[FEATURE_END_INDEX] = {
	FEATURE_END_INDEX,
	FEATURE_END_VALUES,
	FEATURE_BOARD_WIDGET,
	FEATURE_IMAGE_UAC1_DG8SAQ,
	FEATURE_IN_NORMAL,
	FEATURE_OUT_NORMAL,
	FEATURE_ADC_AK5394A,
	FEATURE_DAC_CS4344,
	FEATURE_LCD_HD44780,
	FEATURE_LOG_500MS
};

static uint8_t feature_ram[FEATURE_END_INDEX] = {
	FEATURE_END_INDEX,
	FEATURE_END_VALUES,
	FEATURE_BOARD_WIDGET,
	FEATURE_IMAGE_UAC1_DG8SAQ,
	FEATURE_IN_NORMAL,
	FEATURE_OUT_NORMAL,
	FEATURE_ADC_AK5394A,
	FEATURE_DAC_CS4344,
	FEATURE_LCD_HD44780,
	FEATURE_LOG_500MS
};

