cozycactus/sdr-widget/ports/same70-xplained/same70_usb.c
static const uint8_t audio_sample_rate_48k[] = { 0x80, 0xbb, 0x00 };
static const uint8_t audio_sample_rate_44k1[] = { 0x44, 0xac, 0x00 };
static const uint8_t audio_sample_rate_res[] = { 0x01, 0x00, 0x00 };
static const uint8_t audio_mute_off[] = { 0x00 };
static const uint8_t audio_volume_current[] = { 0x00, 0x00 };
static const uint8_t audio_volume_min[] = { 0x00, 0x80 };
static const uint8_t audio_volume_max[] = { 0xff, 0x7f };
static const uint8_t audio_volume_res[] = { 0x0a, 0x00 };
static const uint8_t audio_feedback_48k_hs[] = { 0x00, 0x00, 0x06, 0x00 };
static const uint8_t audio_feedback_44k1_hs[] = { 0x33, 0x83, 0x05, 0x00 };

static uint32_t usb_initialized;
static uint32_t usb_attached;
static uint32_t usb_reset_count;
static uint32_t usb_setup_count;
static uint32_t usb_tx_count;
static uint32_t usb_rxout_count;
static uint32_t usb_stall_count;
static uint32_t usb_descriptor_count;
static uint32_t usb_set_address_count;
static uint32_t usb_set_configuration_count;
static uint32_t usb_set_interface_count;
static uint32_t audio_set_interface_count;
static uint32_t interface_alternate_peak_mask;
static uint32_t last_set_interface_index;
static uint32_t last_set_interface_value;
static uint32_t audio_config_count;
static uint32_t audio_out_count;
static uint32_t audio_out_bytes;
static uint32_t audio_out_last_bytes;
static uint32_t audio_out_max_bytes;
static uint32_t audio_feedback_count;
static uint32_t audio_feedback_bytes;
static uint32_t audio_feedback_busy_last;
static uint32_t audio_feedback_busy_max;
static uint32_t audio_in_count;
static uint32_t audio_in_bytes;
static uint32_t audio_in_busy_last;
static uint32_t audio_in_busy_max;
static uint32_t audio_error_count;
static uint32_t audio_short_count;
static uint32_t audio_crc_count;
static uint32_t audio_overflow_count;
static uint32_t audio_underflow_count;
static uint32_t audio_source_mode;
static uint32_t audio_out_format;
static uint32_t audio_in_format;
static uint32_t audio_cd_in_frame_accumulator;
static uint8_t audio_loopback_buffer[AUDIO_LOOPBACK_BUFFER_BYTES];
static uint32_t audio_loopback_read;
static uint32_t audio_loopback_write;
static uint32_t audio_loopback_level;
static uint32_t audio_loopback_primed;
static uint32_t audio_loopback_peak;
static uint32_t audio_loopback_drop_bytes;
static uint32_t audio_loopback_silence_bytes;
static uint32_t audio_pattern_lcg;
static uint32_t usb_address;
static uint32_t usb_configuration;
static uint8_t interface_alternate[USB_INTERFACE_COUNT];
static uint32_t pending_address_valid;
static uint32_t pending_address;
static uint32_t pending_device_reset;
static uint32_t pending_audio_sample_rate_valid;
static uint32_t pending_audio_sample_rate_endpoint;
static uint32_t last_setup0;
static uint32_t last_wvalue;
static uint32_t last_windex;
static uint32_t last_wlength;
static ep0_state_t ep0_state;
static const uint8_t *ep0_tx_data;
static uint32_t ep0_tx_remaining;
static uint8_t vendor_response[EP0_SIZE];

static uint16_t read_le16(const uint8_t *data)
{
	return (uint16_t)data[0] | ((uint16_t)data[1] << 8);
}

static uint32_t min_u32(uint32_t a, uint32_t b)
{
	return (a < b) ? a : b;
}

static void reset_audio_in_packet_schedule(void)
{
	audio_cd_in_frame_accumulator = 0u;
}

static void reset_audio_stream_formats(void)
{
	audio_out_format = SAME70_USB_AUDIO_FORMAT_48K24;
	audio_in_format = SAME70_USB_AUDIO_FORMAT_48K24;
	reset_audio_in_packet_schedule();
}

static uint32_t audio_format_from_alternate(uint32_t alternate)
{
	return (alternate == 2u) ? SAME70_USB_AUDIO_FORMAT_44K16 : SAME70_USB_AUDIO_FORMAT_48K24;
}

static uint32_t audio_format_for_endpoint_address(uint32_t endpoint)
{
	uint32_t number = endpoint & 0x0fu;

	if (number == USB_AUDIO_IN_EP) {
		return audio_in_format;
	}
	if ((number == USB_AUDIO_OUT_EP) || (number == USB_AUDIO_FB_EP)) {
		return audio_out_format;
	}

	return audio_out_format;
}

static const uint8_t *audio_sample_rate_for_format(uint32_t format, uint32_t *length)
{
	if (format == SAME70_USB_AUDIO_FORMAT_44K16) {
		*length = sizeof(audio_sample_rate_44k1);
		return audio_sample_rate_44k1;
	}

	*length = sizeof(audio_sample_rate_48k);
	return audio_sample_rate_48k;
}

static const uint8_t *audio_feedback_for_output_format(uint32_t *length)
{
	if (audio_out_format == SAME70_USB_AUDIO_FORMAT_44K16) {
		*length = sizeof(audio_feedback_44k1_hs);
		return audio_feedback_44k1_hs;
	}

	*length = sizeof(audio_feedback_48k_hs);
	return audio_feedback_48k_hs;
}

static uint32_t audio_out_max_packet_bytes(void)
{
	if (audio_out_format == SAME70_USB_AUDIO_FORMAT_44K16) {
		return AUDIO_OUT_44K16_MAX_BYTES;
	}

	return AUDIO_OUT_48K24_MAX_BYTES;
}

static uint32_t audio_in_packet_bytes(void)
{
	uint32_t frames;

	if (audio_in_format != SAME70_USB_AUDIO_FORMAT_44K16) {
		return AUDIO_IN_48K24_PACKET_BYTES;
	}

	audio_cd_in_frame_accumulator += AUDIO_44K16_FRAMES_PER_10MS;
	frames = audio_cd_in_frame_accumulator / AUDIO_44K16_PACKET_DIVISOR;
	audio_cd_in_frame_accumulator -= frames * AUDIO_44K16_PACKET_DIVISOR;
	return frames * AUDIO_44K16_FRAME_BYTES;
}

static uint32_t audio_loopback_prime_bytes(void)
{
	if (audio_in_format == SAME70_USB_AUDIO_FORMAT_44K16) {
		return AUDIO_OUT_44K16_MAX_BYTES * 4u;
	}

	return AUDIO_IN_48K24_PACKET_BYTES * 4u;
}

static void set_audio_interface_format(uint32_t interface, uint32_t alternate)
{
	uint32_t format;

	if (alternate == 0u) {
		return;
	}

	format = audio_format_from_alternate(alternate);
	if (interface == 2u) {
		audio_out_format = format;
	} else if (interface == 3u) {
		audio_in_format = format;
		reset_audio_in_packet_schedule();
	}
}

static uint32_t audio_format_from_sample_rate_data(const uint8_t *data, uint32_t *format)
{
	if ((data[0] == audio_sample_rate_44k1[0]) &&
	    (data[1] == audio_sample_rate_44k1[1]) &&
	    (data[2] == audio_sample_rate_44k1[2])) {
		*format = SAME70_USB_AUDIO_FORMAT_44K16;
		return 1u;
	}
	if ((data[0] == audio_sample_rate_48k[0]) &&
	    (data[1] == audio_sample_rate_48k[1]) &&
	    (data[2] == audio_sample_rate_48k[2])) {
		*format = SAME70_USB_AUDIO_FORMAT_48K24;
		return 1u;
	}

	return 0u;
}

static void set_audio_endpoint_format(uint32_t endpoint, uint32_t format)
{
	uint32_t number = endpoint & 0x0fu;

	if (number == USB_AUDIO_IN_EP) {
		audio_in_format = format;
		reset_audio_in_packet_schedule();
	} else if ((number == USB_AUDIO_OUT_EP) || (number == USB_AUDIO_FB_EP)) {
		audio_out_format = format;
	} else {
		audio_out_format = format;
		audio_in_format = format;
		reset_audio_in_packet_schedule();
	}
}

static void handle_ep0_out_data(uint32_t length)
{
	volatile uint8_t *fifo = USBHS_EP_FIFO(0u);
	uint8_t rate[3];
	uint32_t format;

	if ((pending_audio_sample_rate_valid == 0u) || (length < sizeof(rate))) {
		pending_audio_sample_rate_valid = 0u;
		return;
	}

	rate[0] = fifo[0];
	rate[1] = fifo[1];
	rate[2] = fifo[2];
	if (audio_format_from_sample_rate_data(rate, &format) != 0u) {
		set_audio_endpoint_format(pending_audio_sample_rate_endpoint, format);
	}
	pending_audio_sample_rate_valid = 0u;
}

