cozycactus/sdr-widget/ports/same70-xplained/same70_usb.c
static uint32_t string_length(const char *text)
{
	uint32_t length = 0u;

	while (text[length] != '\0') {
		length++;
	}

	return length;
}

static uint32_t copy_reversed_string(uint8_t *dest, const char *text)
{
	uint32_t length = min_u32(string_length(text), EP0_SIZE);
	uint32_t index;

	for (index = 0u; index < length; index++) {
		dest[index] = (uint8_t)text[length - 1u - index];
	}

	return length;
}

static void wait_for_locku(void)
{
	uint32_t timeout = 1000000u;

	while (((PMC_SR & PMC_SR_LOCKU) == 0u) && (timeout != 0u)) {
		timeout--;
	}
}

static void wait_for_clkusable(void)
{
	uint32_t timeout = 1000000u;

	while (((USBHS_SR & USBHS_SR_CLKUSABLE) == 0u) && (timeout != 0u)) {
		timeout--;
	}
}

static void system_reset(void)
{
	SCB_AIRCR = SCB_AIRCR_VECTKEY | (SCB_AIRCR & SCB_AIRCR_PRIGROUP_Msk) | SCB_AIRCR_SYSRESETREQ;
	while (1) {
	}
}

static void set_usb_address(uint32_t address)
{
	uint32_t devctrl = USBHS_DEVCTRL;

	devctrl &= ~(USBHS_DEVCTRL_UADD_MASK | USBHS_DEVCTRL_ADDEN);
	devctrl |= address & USBHS_DEVCTRL_UADD_MASK;
	if (address != 0u) {
		devctrl |= USBHS_DEVCTRL_ADDEN;
	}
	USBHS_DEVCTRL = devctrl;
	usb_address = address;
}

static void clear_interface_alternates(void)
{
	uint32_t index;

	for (index = 0u; index < USB_INTERFACE_COUNT; index++) {
		interface_alternate[index] = 0u;
	}
	reset_audio_stream_formats();
}

static uint32_t interface_alternate_mask(void)
{
	uint32_t mask = 0u;
	uint32_t index;

	for (index = 0u; index < USB_INTERFACE_COUNT; index++) {
		if (interface_alternate[index] != 0u) {
			mask |= 1u << index;
		}
	}

	return mask;
}

static void update_interface_alternate_peak(void)
{
	interface_alternate_peak_mask |= interface_alternate_mask();
}

static void clear_ep0_state(void)
{
	ep0_state = EP0_STATE_IDLE;
	ep0_tx_data = 0;
	ep0_tx_remaining = 0u;
	pending_address_valid = 0u;
	pending_device_reset = 0u;
	pending_audio_sample_rate_valid = 0u;
}

static void configure_ep0(void)
{
	USBHS_DEVEPT = USBHS_DEVEPT_EPRST0;
	USBHS_DEVEPT = 0u;
	USBHS_DEVEPTCFG(0u) =
		USBHS_DEVEPTCFG_ALLOC |
		USBHS_DEVEPTCFG_1_BANK |
		USBHS_DEVEPTCFG_64B |
		USBHS_DEVEPTCFG_CTRL;
	USBHS_DEVEPT = USBHS_DEVEPT_EPEN0;
	USBHS_DEVEPTIER(0u) = USBHS_DEVEPTIER_RSTDTS | USBHS_DEVEPTIER_RXSTPES | USBHS_DEVEPTIER_RXOUTES;
	USBHS_DEVEPTIDR(0u) = USBHS_DEVEPTIDR_STALLRQC;
	clear_ep0_state();
}

static void reset_endpoint(uint32_t ep)
{
	uint32_t enabled = USBHS_DEVEPT & 0xffffu;

	USBHS_DEVEPT = enabled | USBHS_DEVEPT_EPRST(ep);
	USBHS_DEVEPT = enabled & ~USBHS_DEVEPT_EPEN(ep);
}

static void configure_audio_endpoint(uint32_t ep, uint32_t direction, uint32_t size)
{
	reset_endpoint(ep);
	USBHS_DEVEPTCFG(ep) =
		USBHS_DEVEPTCFG_ALLOC |
		USBHS_DEVEPTCFG_2_BANK |
		size |
		direction |
		USBHS_DEVEPTCFG_ISO;
	USBHS_DEVEPT |= USBHS_DEVEPT_EPEN(ep);
	USBHS_DEVEPTIER(ep) = USBHS_DEVEPTIER_RSTDTS;
	USBHS_DEVEPTIDR(ep) = USBHS_DEVEPTIDR_STALLRQC;
}

static void disable_audio_endpoints(void)
{
	reset_endpoint(USB_AUDIO_OUT_EP);
	reset_endpoint(USB_AUDIO_FB_EP);
	reset_endpoint(USB_AUDIO_IN_EP);
	USBHS_DEVEPTCFG(USB_AUDIO_OUT_EP) = 0u;
	USBHS_DEVEPTCFG(USB_AUDIO_FB_EP) = 0u;
	USBHS_DEVEPTCFG(USB_AUDIO_IN_EP) = 0u;
}

static uint32_t audio_cfgok_mask(void)
{
	uint32_t mask = 0u;

	if ((USBHS_DEVEPTISR(USB_AUDIO_OUT_EP) & USBHS_DEVEPTISR_CFGOK) != 0u) {
		mask |= USBHS_DEVEPT_EPEN(USB_AUDIO_OUT_EP);
	}
	if ((USBHS_DEVEPTISR(USB_AUDIO_FB_EP) & USBHS_DEVEPTISR_CFGOK) != 0u) {
		mask |= USBHS_DEVEPT_EPEN(USB_AUDIO_FB_EP);
	}
	if ((USBHS_DEVEPTISR(USB_AUDIO_IN_EP) & USBHS_DEVEPTISR_CFGOK) != 0u) {
		mask |= USBHS_DEVEPT_EPEN(USB_AUDIO_IN_EP);
	}

	return mask;
}

static void configure_audio_endpoints(void)
{
	uint32_t expected =
		USBHS_DEVEPT_EPEN(USB_AUDIO_OUT_EP) |
		USBHS_DEVEPT_EPEN(USB_AUDIO_FB_EP) |
		USBHS_DEVEPT_EPEN(USB_AUDIO_IN_EP);
	uint32_t timeout = 1000u;

	configure_audio_endpoint(USB_AUDIO_OUT_EP, 0u, USBHS_DEVEPTCFG_512B);
	configure_audio_endpoint(USB_AUDIO_FB_EP, USBHS_DEVEPTCFG_IN, USBHS_DEVEPTCFG_8B);
	configure_audio_endpoint(USB_AUDIO_IN_EP, USBHS_DEVEPTCFG_IN, USBHS_DEVEPTCFG_512B);
	audio_config_count++;

	while ((audio_cfgok_mask() != expected) && (timeout != 0u)) {
		timeout--;
	}

	if (audio_cfgok_mask() != expected) {
		audio_error_count++;
	}
}

static void clear_iso_status(uint32_t ep, uint32_t isr);

static void reset_audio_loopback_buffer(void)
{
	audio_loopback_read = 0u;
	audio_loopback_write = 0u;
	audio_loopback_level = 0u;
	audio_loopback_primed = 0u;
}

static void audio_loopback_push(uint8_t value)
{
	if (audio_loopback_level >= AUDIO_LOOPBACK_BUFFER_BYTES) {
		audio_loopback_drop_bytes++;
		return;
	}

	audio_loopback_buffer[audio_loopback_write] = value;
	audio_loopback_write++;
	if (audio_loopback_write >= AUDIO_LOOPBACK_BUFFER_BYTES) {
		audio_loopback_write = 0u;
	}
	audio_loopback_level++;
	if (audio_loopback_level > audio_loopback_peak) {
		audio_loopback_peak = audio_loopback_level;
	}
}

static uint32_t audio_loopback_pop(uint8_t *value)
{
	if (audio_loopback_level == 0u) {
		*value = 0u;
		audio_loopback_silence_bytes++;
		return 0u;
	}

	*value = audio_loopback_buffer[audio_loopback_read];
	audio_loopback_read++;
	if (audio_loopback_read >= AUDIO_LOOPBACK_BUFFER_BYTES) {
		audio_loopback_read = 0u;
	}
	audio_loopback_level--;
	return 1u;
}

static uint32_t next_audio_pattern_sample(void)
{
	uint32_t sample;

	audio_pattern_lcg = (audio_pattern_lcg * 1664525u) + 1013904223u;
	sample = (audio_pattern_lcg >> 9) & 0x3fffffu;
	if (sample == 0x200000u) {
		sample++;
	}

	return (sample - 0x200000u) & 0x00ffffffu;
}

static uint32_t next_audio_pattern_sample16(void)
{
	uint32_t sample;

	audio_pattern_lcg = (audio_pattern_lcg * 1664525u) + 1013904223u;
	sample = (audio_pattern_lcg >> 17) & 0x3fffu;
	if (sample == 0x2000u) {
		sample++;
	}

	return (sample - 0x2000u) & 0x0000ffffu;
}

static void reset_audio_pattern(void)
{
	audio_pattern_lcg = 0x12345678u;
}

static void write_pcm16_le(volatile uint8_t *fifo, uint32_t offset, uint32_t value)
{
	fifo[offset] = (uint8_t)(value & 0xffu);
	fifo[offset + 1u] = (uint8_t)((value >> 8) & 0xffu);
}

static void write_pcm24_le(volatile uint8_t *fifo, uint32_t offset, uint32_t value)
{
	fifo[offset] = (uint8_t)(value & 0xffu);
	fifo[offset + 1u] = (uint8_t)((value >> 8) & 0xffu);
	fifo[offset + 2u] = (uint8_t)((value >> 16) & 0xffu);
}

