cozycactus/sdr-widget/ports/same70-xplained/same70_usb.c
static void reset_audio_interface_data_toggle(uint32_t interface)
{
	if (interface == 2u) {
		reset_audio_loopback_buffer();
		reset_audio_pattern();
		USBHS_DEVEPTIER(USB_AUDIO_OUT_EP) = USBHS_DEVEPTIER_RSTDTS;
		USBHS_DEVEPTIER(USB_AUDIO_FB_EP) = USBHS_DEVEPTIER_RSTDTS;
		clear_iso_status(USB_AUDIO_OUT_EP, USBHS_DEVEPTISR(USB_AUDIO_OUT_EP));
		clear_iso_status(USB_AUDIO_FB_EP, USBHS_DEVEPTISR(USB_AUDIO_FB_EP));
	} else if (interface == 3u) {
		reset_audio_loopback_buffer();
		reset_audio_pattern();
		reset_audio_in_packet_schedule();
		USBHS_DEVEPTIER(USB_AUDIO_IN_EP) = USBHS_DEVEPTIER_RSTDTS;
		clear_iso_status(USB_AUDIO_IN_EP, USBHS_DEVEPTISR(USB_AUDIO_IN_EP));
	}
}

static void ep0_write_packet(const uint8_t *data, uint32_t length)
{
	volatile uint8_t *fifo = USBHS_EP_FIFO(0u);
	uint32_t index;

	for (index = 0u; index < length; index++) {
		fifo[index] = data[index];
	}

	USBHS_DEVEPTICR(0u) = USBHS_DEVEPTICR_TXINIC;
	USBHS_DEVEPTIDR(0u) = USBHS_DEVEPTIDR_FIFOCONC;
	usb_tx_count++;
}

static void ep0_send_next_data(void)
{
	uint32_t count = min_u32(ep0_tx_remaining, EP0_SIZE);

	ep0_write_packet(ep0_tx_data, count);
	ep0_tx_data += count;
	ep0_tx_remaining -= count;
	if (ep0_tx_remaining == 0u) {
		ep0_state = EP0_STATE_WAIT_OUT_STATUS;
	}
}

static void ep0_start_in(const uint8_t *data, uint32_t length)
{
	uint32_t count = min_u32(length, EP0_SIZE);

	ep0_tx_data = data + count;
	ep0_tx_remaining = length - count;
	ep0_state = (ep0_tx_remaining == 0u) ? EP0_STATE_WAIT_OUT_STATUS : EP0_STATE_TX_DATA;
	ep0_write_packet(data, count);
}

static void ep0_start_status_in(void)
{
	ep0_state = EP0_STATE_TX_STATUS;
	ep0_write_packet(one_byte_zero, 0u);
}

static void ep0_expect_out_data_status(void)
{
	ep0_state = EP0_STATE_RX_DATA_STATUS;
	ep0_tx_data = 0;
	ep0_tx_remaining = 0u;
}

static void ep0_stall(void)
{
	USBHS_DEVEPTIER(0u) = USBHS_DEVEPTIER_STALLRQS;
	ep0_state = EP0_STATE_IDLE;
	ep0_tx_data = 0;
	ep0_tx_remaining = 0u;
	pending_address_valid = 0u;
	usb_stall_count++;
}

static void write_endpoint_packet(uint32_t ep, const uint8_t *data, uint32_t length)
{
	volatile uint8_t *fifo = USBHS_EP_FIFO(ep);
	uint32_t index;

	for (index = 0u; index < length; index++) {
		fifo[index] = data[index];
	}

	USBHS_DEVEPTICR(ep) = USBHS_DEVEPTICR_TXINIC;
	USBHS_DEVEPTIDR(ep) = USBHS_DEVEPTIDR_FIFOCONC;
}

static void write_endpoint_loopback_packet(uint32_t ep, uint32_t length)
{
	volatile uint8_t *fifo = USBHS_EP_FIFO(ep);
	uint32_t index;
	uint8_t value;

	if (audio_loopback_primed == 0u) {
		if (audio_loopback_level < audio_loopback_prime_bytes()) {
			for (index = 0u; index < length; index++) {
				fifo[index] = 0u;
			}
			audio_loopback_silence_bytes += length;
			USBHS_DEVEPTICR(ep) = USBHS_DEVEPTICR_TXINIC;
			USBHS_DEVEPTIDR(ep) = USBHS_DEVEPTIDR_FIFOCONC;
			return;
		}
		audio_loopback_primed = 1u;
	}

	if (audio_loopback_level < length) {
		audio_loopback_primed = 0u;
		for (index = 0u; index < length; index++) {
			fifo[index] = 0u;
		}
		audio_loopback_silence_bytes += length;
		USBHS_DEVEPTICR(ep) = USBHS_DEVEPTICR_TXINIC;
		USBHS_DEVEPTIDR(ep) = USBHS_DEVEPTIDR_FIFOCONC;
		return;
	}

	for (index = 0u; index < length; index++) {
		(void)audio_loopback_pop(&value);
		fifo[index] = value;
	}

	USBHS_DEVEPTICR(ep) = USBHS_DEVEPTICR_TXINIC;
	USBHS_DEVEPTIDR(ep) = USBHS_DEVEPTIDR_FIFOCONC;
}

static void write_endpoint_pattern_packet(uint32_t ep, uint32_t length)
{
	volatile uint8_t *fifo = USBHS_EP_FIFO(ep);
	uint32_t index;

	if (audio_in_format == SAME70_USB_AUDIO_FORMAT_44K16) {
		for (index = 0u; (index + 1u) < length; index += 2u) {
			write_pcm16_le(fifo, index, next_audio_pattern_sample16());
		}
	} else {
		for (index = 0u; (index + 2u) < length; index += 3u) {
			write_pcm24_le(fifo, index, next_audio_pattern_sample());
		}
	}
	for (; index < length; index++) {
		fifo[index] = 0u;
	}

	USBHS_DEVEPTICR(ep) = USBHS_DEVEPTICR_TXINIC;
	USBHS_DEVEPTIDR(ep) = USBHS_DEVEPTIDR_FIFOCONC;
}

static void write_endpoint_silence_packet(uint32_t ep, uint32_t length)
{
	volatile uint8_t *fifo = USBHS_EP_FIFO(ep);
	uint32_t index;

	for (index = 0u; index < length; index++) {
		fifo[index] = 0u;
	}

	USBHS_DEVEPTICR(ep) = USBHS_DEVEPTICR_TXINIC;
	USBHS_DEVEPTIDR(ep) = USBHS_DEVEPTIDR_FIFOCONC;
}

static uint32_t endpoint_byte_count(uint32_t isr)
{
	return (isr & USBHS_DEVEPTISR_BYCT_MASK) >> USBHS_DEVEPTISR_BYCT_SHIFT;
}

static uint32_t endpoint_busy_banks(uint32_t isr)
{
	return (isr & USBHS_DEVEPTISR_NBUSYBK_MASK) >> USBHS_DEVEPTISR_NBUSYBK_SHIFT;
}

static void clear_iso_status(uint32_t ep, uint32_t isr)
{
	uint32_t clear =
		isr & (USBHS_DEVEPTICR_UNDERFIC |
		       USBHS_DEVEPTICR_HBISOINERRIC |
		       USBHS_DEVEPTICR_HBISOFLUSHIC |
		       USBHS_DEVEPTICR_OVERFIC |
		       USBHS_DEVEPTICR_CRCERRIC |
		       USBHS_DEVEPTICR_SHORTPACKETIC);

	if (clear != 0u) {
		USBHS_DEVEPTICR(ep) = clear;
	}
}

static void count_iso_status(uint32_t ep, uint32_t isr)
{
	uint32_t clear = 0u;

	if ((isr & USBHS_DEVEPTISR_SHORTPACKETI) != 0u) {
		audio_short_count++;
		clear |= USBHS_DEVEPTICR_SHORTPACKETIC;
	}
	if ((isr & USBHS_DEVEPTISR_CRCERRI) != 0u) {
		audio_crc_count++;
		audio_error_count++;
		clear |= USBHS_DEVEPTICR_CRCERRIC;
	}
	if ((isr & USBHS_DEVEPTISR_OVERFI) != 0u) {
		audio_overflow_count++;
		audio_error_count++;
		clear |= USBHS_DEVEPTICR_OVERFIC;
	}
	if ((isr & USBHS_DEVEPTISR_HBISOFLUSHI) != 0u) {
		audio_error_count++;
		clear |= USBHS_DEVEPTICR_HBISOFLUSHIC;
	}
	if ((isr & USBHS_DEVEPTISR_HBISOINERRI) != 0u) {
		audio_error_count++;
		clear |= USBHS_DEVEPTICR_HBISOINERRIC;
	}
	if ((isr & USBHS_DEVEPTISR_UNDERFI) != 0u) {
		audio_underflow_count++;
		audio_error_count++;
		clear |= USBHS_DEVEPTICR_UNDERFIC;
	}

	if (clear != 0u) {
		USBHS_DEVEPTICR(ep) = clear;
	}
}

static void poll_audio_out(void)
{
	volatile uint8_t *fifo = USBHS_EP_FIFO(USB_AUDIO_OUT_EP);
	uint32_t isr = USBHS_DEVEPTISR(USB_AUDIO_OUT_EP);
	uint32_t bytes;
	uint32_t index;

	if ((usb_configuration == 0u) || (interface_alternate[2] == 0u)) {
		clear_iso_status(USB_AUDIO_OUT_EP, isr);
		return;
	}

	count_iso_status(USB_AUDIO_OUT_EP, isr);
	if ((isr & USBHS_DEVEPTISR_RXOUTI) == 0u) {
		return;
	}

	bytes = min_u32(endpoint_byte_count(isr), audio_out_max_packet_bytes());
	for (index = 0u; index < bytes; index++) {
		if (audio_source_mode == SAME70_USB_AUDIO_SOURCE_LOOPBACK) {
			audio_loopback_push(fifo[index]);
		} else {
			(void)fifo[index];
		}
	}

	USBHS_DEVEPTICR(USB_AUDIO_OUT_EP) = USBHS_DEVEPTICR_RXOUTIC;
	USBHS_DEVEPTIDR(USB_AUDIO_OUT_EP) = USBHS_DEVEPTIDR_FIFOCONC;
	audio_out_count++;
	audio_out_bytes += bytes;
	audio_out_last_bytes = bytes;
	if (bytes > audio_out_max_bytes) {
		audio_out_max_bytes = bytes;
	}
}

