cozycactus/sdr-widget/ports/same70-xplained/same70_usb.c
static void poll_audio_feedback(void)
{
	uint32_t isr = USBHS_DEVEPTISR(USB_AUDIO_FB_EP);
	const uint8_t *feedback;
	uint32_t feedback_length;
	uint32_t busy;
	uint32_t attempts;

	if ((usb_configuration == 0u) || (interface_alternate[2] == 0u)) {
		clear_iso_status(USB_AUDIO_FB_EP, isr);
		return;
	}

	for (attempts = 0u; attempts < 2u; attempts++) {
		isr = USBHS_DEVEPTISR(USB_AUDIO_FB_EP);
		count_iso_status(USB_AUDIO_FB_EP, isr);
		busy = endpoint_busy_banks(isr);
		audio_feedback_busy_last = busy;
		if (busy > audio_feedback_busy_max) {
			audio_feedback_busy_max = busy;
		}
		if (((isr & USBHS_DEVEPTISR_RWALL) == 0u) || (busy >= 2u)) {
			break;
		}
		feedback = audio_feedback_for_output_format(&feedback_length);
		write_endpoint_packet(USB_AUDIO_FB_EP, feedback, feedback_length);
		audio_feedback_count++;
		audio_feedback_bytes += feedback_length;
	}
}

static void poll_audio_in(void)
{
	uint32_t isr = USBHS_DEVEPTISR(USB_AUDIO_IN_EP);
	uint32_t packet_bytes;
	uint32_t busy;
	uint32_t attempts;

	if ((usb_configuration == 0u) || (interface_alternate[3] == 0u)) {
		clear_iso_status(USB_AUDIO_IN_EP, isr);
		return;
	}

	for (attempts = 0u; attempts < 2u; attempts++) {
		isr = USBHS_DEVEPTISR(USB_AUDIO_IN_EP);
		count_iso_status(USB_AUDIO_IN_EP, isr);
		busy = endpoint_busy_banks(isr);
		audio_in_busy_last = busy;
		if (busy > audio_in_busy_max) {
			audio_in_busy_max = busy;
		}
		if (((isr & USBHS_DEVEPTISR_RWALL) == 0u) || (busy >= 2u)) {
			break;
		}
		packet_bytes = audio_in_packet_bytes();
		if (audio_source_mode == SAME70_USB_AUDIO_SOURCE_PATTERN) {
			write_endpoint_pattern_packet(USB_AUDIO_IN_EP, packet_bytes);
		} else if (audio_source_mode == SAME70_USB_AUDIO_SOURCE_SILENCE) {
			write_endpoint_silence_packet(USB_AUDIO_IN_EP, packet_bytes);
		} else {
			write_endpoint_loopback_packet(USB_AUDIO_IN_EP, packet_bytes);
		}
		audio_in_count++;
		audio_in_bytes += packet_bytes;
	}
}

static void poll_audio_endpoints(void)
{
	poll_audio_out();
	poll_audio_feedback();
	poll_audio_in();
}

static void prime_audio_interface(uint32_t interface)
{
	if (interface == 2u) {
		poll_audio_feedback();
	} else if (interface == 3u) {
		poll_audio_in();
	}
}

static uint32_t select_descriptor(uint8_t type, uint8_t index, const uint8_t **data, uint32_t *length)
{
	switch (type) {
	case USB_DESC_DEVICE:
		*data = device_descriptor;
		*length = sizeof(device_descriptor);
		return 1u;
	case USB_DESC_CONFIGURATION:
		*data = configuration_descriptor;
		*length = sizeof(configuration_descriptor);
		return 1u;
	case USB_DESC_OTHER_SPEED:
		*data = other_speed_configuration_descriptor;
		*length = sizeof(other_speed_configuration_descriptor);
		return 1u;
	case USB_DESC_DEVICE_QUAL:
		*data = device_qualifier_descriptor;
		*length = sizeof(device_qualifier_descriptor);
		return 1u;
	case USB_DESC_STRING:
		if (index == 0u) {
			*data = string0_descriptor;
			*length = sizeof(string0_descriptor);
			return 1u;
		}
		if (index == 1u) {
			*data = manufacturer_string_descriptor;
			*length = sizeof(manufacturer_string_descriptor);
			return 1u;
		}
		if (index == 2u) {
			*data = product_string_descriptor;
			*length = sizeof(product_string_descriptor);
			return 1u;
		}
		if (index == 3u) {
			*data = serial_string_descriptor;
			*length = sizeof(serial_string_descriptor);
			return 1u;
		}
		break;
	default:
		break;
	}

	return 0u;
}

static void handle_get_descriptor(const usb_setup_t *setup)
{
	const uint8_t *data = 0;
	uint32_t length = 0u;
	uint8_t index = (uint8_t)(setup->value & 0xffu);
	uint8_t type = (uint8_t)(setup->value >> 8);

	if (select_descriptor(type, index, &data, &length) == 0u) {
		ep0_stall();
		return;
	}

	if (setup->length < length) {
		length = setup->length;
	}

	usb_descriptor_count++;
	ep0_start_in(data, length);
}

static uint8_t feature_get(const uint8_t *features, uint32_t index)
{
	if (index >= FEATURE_END_INDEX) {
		return 0xffu;
	}

	return features[index];
}

static uint8_t feature_set(uint8_t *features, uint32_t encoded_index_value)
{
	uint32_t index = encoded_index_value & 0xffu;
	uint32_t value = (encoded_index_value >> 8) & 0xffu;

	if ((index <= FEATURE_MINOR_INDEX) || (index >= FEATURE_END_INDEX) || (value >= FEATURE_END_VALUES)) {
		return 0xffu;
	}

	features[index] = (uint8_t)value;
	return features[index];
}

static void ep0_start_in_clipped(const usb_setup_t *setup, const uint8_t *data, uint32_t length)
{
	ep0_start_in(data, min_u32(length, setup->length));
}

static void handle_feature_request(const usb_setup_t *setup)
{
	uint32_t index = setup->index;
	uint32_t length = 1u;

	vendor_response[0] = 0u;

	switch (setup->value) {
	case 0u:
	case 1u:
		vendor_response[0] = 0u;
		break;
	case FEATURE_DG8SAQ_SET_NVRAM:
		vendor_response[0] = feature_set(feature_nvram, index);
		break;
	case FEATURE_DG8SAQ_GET_NVRAM:
		vendor_response[0] = feature_get(feature_nvram, index);
		break;
	case FEATURE_DG8SAQ_SET_RAM:
		vendor_response[0] = feature_set(feature_ram, index);
		break;
	case FEATURE_DG8SAQ_GET_RAM:
		vendor_response[0] = feature_get(feature_ram, index);
		break;
	case FEATURE_DG8SAQ_GET_INDEX:
		length = copy_reversed_string(vendor_response,
			(index <= FEATURE_END_INDEX) ? feature_index_names[index] : "?");
		break;
	case FEATURE_DG8SAQ_GET_VALUE:
		length = copy_reversed_string(vendor_response,
			(index <= FEATURE_END_VALUES) ? feature_value_names[index] : "?");
		break;
	case FEATURE_DG8SAQ_GET_DEFAULT:
		vendor_response[0] = feature_get(feature_defaults, index);
		break;
	default:
		vendor_response[0] = 0xffu;
		break;
	}

	ep0_start_in_clipped(setup, vendor_response, length);
}

static void handle_vendor_request(const usb_setup_t *setup)
{
	if (setup->bm_request_type != 0xc0u) {
		ep0_stall();
		return;
	}

	switch (setup->request) {
	case WIDGET_REQ_RESET:
		vendor_response[0] = 0u;
		pending_device_reset = 1u;
		ep0_start_in_clipped(setup, vendor_response, 1u);
		break;
	case FEATURE_DG8SAQ_COMMAND:
		handle_feature_request(setup);
		break;
	default:
		ep0_stall();
		break;
	}
}

