cozycactus/sdr-widget/ports/same70-xplained/same70_usb.c
static void handle_audio_class_in_request(const usb_setup_t *setup)
{
	const uint8_t *data = 0;
	uint32_t length = 0u;
	uint32_t recipient = setup->bm_request_type & 0x1fu;
	uint32_t control = setup->value >> 8;
	uint32_t unit = setup->index >> 8;

	if (recipient == 2u) {
		if (control != AUDIO_CONTROL_SAMPLE_FREQ) {
			ep0_stall();
			return;
		}
		switch (setup->request) {
		case AUDIO_REQ_GET_CUR:
		case AUDIO_REQ_GET_MIN:
		case AUDIO_REQ_GET_MAX:
			data = audio_sample_rate_for_format(
				audio_format_for_endpoint_address(setup->index & 0xffu),
				&length);
			break;
		case AUDIO_REQ_GET_RES:
			data = audio_sample_rate_res;
			length = sizeof(audio_sample_rate_res);
			break;
		default:
			ep0_stall();
			return;
		}
		ep0_start_in_clipped(setup, data, length);
		return;
	}

	if ((recipient != 1u) || ((unit != AUDIO_MIC_FEATURE_UNIT) && (unit != AUDIO_SPK_FEATURE_UNIT))) {
		ep0_stall();
		return;
	}

	if (control == AUDIO_CONTROL_MUTE) {
		data = audio_mute_off;
		length = sizeof(audio_mute_off);
	} else if (control == AUDIO_CONTROL_VOLUME) {
		length = sizeof(audio_volume_current);
		switch (setup->request) {
		case AUDIO_REQ_GET_CUR:
			data = audio_volume_current;
			break;
		case AUDIO_REQ_GET_MIN:
			data = audio_volume_min;
			break;
		case AUDIO_REQ_GET_MAX:
			data = audio_volume_max;
			break;
		case AUDIO_REQ_GET_RES:
			data = audio_volume_res;
			break;
		default:
			ep0_stall();
			return;
		}
	} else {
		ep0_stall();
		return;
	}

	ep0_start_in_clipped(setup, data, length);
}

static void handle_class_request(const usb_setup_t *setup)
{
	if ((setup->bm_request_type & 0x80u) != 0u) {
		handle_audio_class_in_request(setup);
		return;
	}

	pending_audio_sample_rate_valid = 0u;
	if ((setup->request == AUDIO_REQ_SET_CUR) && (setup->length <= EP0_SIZE)) {
		if (((setup->bm_request_type & 0x1fu) == 2u) &&
		    ((setup->value >> 8) == AUDIO_CONTROL_SAMPLE_FREQ) &&
		    (setup->length == sizeof(audio_sample_rate_48k))) {
			pending_audio_sample_rate_valid = 1u;
			pending_audio_sample_rate_endpoint = setup->index & 0xffu;
		}
		if (setup->length == 0u) {
			ep0_start_status_in();
		} else {
			ep0_expect_out_data_status();
		}
		return;
	}

	ep0_stall();
}

static void handle_setup(const usb_setup_t *setup)
{
	uint32_t recipient = setup->bm_request_type & 0x1fu;

	last_setup0 = ((uint32_t)setup->bm_request_type << 8) | setup->request;
	last_wvalue = setup->value;
	last_windex = setup->index;
	last_wlength = setup->length;

	if ((setup->bm_request_type & 0x60u) == 0x40u) {
		handle_vendor_request(setup);
		return;
	}

	if ((setup->bm_request_type & 0x60u) == 0x20u) {
		handle_class_request(setup);
		return;
	}

	if ((setup->bm_request_type & 0x60u) != 0u) {
		ep0_stall();
		return;
	}

	switch (setup->request) {
	case USB_REQ_GET_DESCRIPTOR:
		if (setup->bm_request_type != 0x80u) {
			ep0_stall();
			return;
		}
		handle_get_descriptor(setup);
		break;
	case USB_REQ_SET_ADDRESS:
		if ((setup->bm_request_type != 0x00u) || (setup->index != 0u) || (setup->length != 0u) ||
		    (setup->value > 127u)) {
			ep0_stall();
			return;
		}
		pending_address = setup->value;
		pending_address_valid = 1u;
		usb_set_address_count++;
		ep0_start_status_in();
		break;
	case USB_REQ_SET_CONFIGURATION:
		if ((setup->bm_request_type != 0x00u) || (setup->index != 0u) || (setup->length != 0u) ||
		    (setup->value > 1u)) {
			ep0_stall();
			return;
		}
		usb_configuration = setup->value;
		clear_interface_alternates();
		interface_alternate_peak_mask = 0u;
		if (usb_configuration == 0u) {
			disable_audio_endpoints();
		} else {
			configure_audio_endpoints();
		}
		usb_set_configuration_count++;
		ep0_start_status_in();
		break;
	case USB_REQ_GET_CONFIGURATION:
		if (setup->bm_request_type != 0x80u) {
			ep0_stall();
			return;
		}
		ep0_start_in((usb_configuration == 0u) ? one_byte_zero : (const uint8_t *)&usb_configuration, 1u);
		break;
	case USB_REQ_GET_STATUS:
		if (((setup->bm_request_type & 0x80u) == 0u) || (setup->value != 0u) || (setup->length != 2u)) {
			ep0_stall();
			return;
		}
		ep0_start_in((recipient == 0u) ? status_self_powered : status_zero, 2u);
		break;
	case USB_REQ_GET_INTERFACE:
		if ((setup->bm_request_type != 0x81u) || (setup->value != 0u) ||
		    (setup->index >= USB_INTERFACE_COUNT)) {
			ep0_stall();
			return;
		}
		vendor_response[0] = interface_alternate[setup->index];
		ep0_start_in(vendor_response, min_u32(setup->length, 1u));
		break;
	case USB_REQ_SET_INTERFACE:
		if ((setup->bm_request_type != 0x01u) || (setup->length != 0u) ||
		    (setup->index >= USB_INTERFACE_COUNT) ||
		    ((setup->index < 2u) && (setup->value != 0u)) ||
		    ((setup->index >= 2u) && (setup->value > 2u))) {
			ep0_stall();
			return;
		}
		interface_alternate[setup->index] = (uint8_t)setup->value;
		update_interface_alternate_peak();
		usb_set_interface_count++;
		last_set_interface_index = setup->index;
		last_set_interface_value = setup->value;
		if (setup->index >= 2u) {
			set_audio_interface_format(setup->index, setup->value);
			audio_set_interface_count++;
			reset_audio_interface_data_toggle(setup->index);
			if (setup->value != 0u) {
				prime_audio_interface(setup->index);
			}
		}
		ep0_start_status_in();
		break;
	case USB_REQ_CLEAR_FEATURE:
		if ((setup->length != 0u) || (setup->value != 0u)) {
			ep0_stall();
			return;
		}
		ep0_start_status_in();
		break;
	default:
		ep0_stall();
		break;
	}
}

static void poll_setup_packet(void)
{
	volatile uint8_t *fifo = USBHS_EP_FIFO(0u);
	uint8_t raw[8];
	usb_setup_t setup;
	uint32_t index;

	for (index = 0u; index < sizeof(raw); index++) {
		raw[index] = fifo[index];
	}

	setup.bm_request_type = raw[0];
	setup.request = raw[1];
	setup.value = read_le16(&raw[2]);
	setup.index = read_le16(&raw[4]);
	setup.length = read_le16(&raw[6]);

	usb_setup_count++;
	USBHS_DEVEPTIDR(0u) = USBHS_DEVEPTIDR_STALLRQC;
	USBHS_DEVEPTICR(0u) = USBHS_DEVEPTICR_RXSTPIC;
	handle_setup(&setup);
}

void same70_usb_init(void)
{
	CKGR_UCKR = CKGR_UCKR_UPLLEN | CKGR_UCKR_UPLLCOUNT(0xfu);
	wait_for_locku();

	PMC_USB = PMC_USB_USBS_UPLL | PMC_USB_USBDIV(9u);
	PMC_SCER = PMC_SCER_USBCLK;
	PMC_PCER1 = USBHS_PCER1_BIT;

