cozycactus/sdr-widget/ports/same70-xplained/same70_usb.c
	USBHS_DEVIDR = USBHS_DEVIDR_ALL;
	USBHS_CTRL = USBHS_CTRL_VBUSHWC | USBHS_CTRL_UIMOD_DEV;
	USBHS_CTRL |= USBHS_CTRL_USBE;
	USBHS_CTRL &= ~USBHS_CTRL_FRZCLK;
	wait_for_clkusable();

	USBHS_DEVCTRL = USBHS_DEVCTRL_DETACH | USBHS_DEVCTRL_NORMAL;
	USBHS_DEVIER = USBHS_DEVIER_EORSTES | USBHS_DEVIER_PEP0;
	set_usb_address(0u);
	usb_configuration = 0u;
	clear_interface_alternates();
	configure_ep0();

	usb_initialized = 1u;
	usb_attached = 0u;
}

void same70_usb_attach(void)
{
	if (usb_initialized == 0u) {
		same70_usb_init();
	}

	USBHS_DEVCTRL &= ~USBHS_DEVCTRL_DETACH;
	usb_attached = 1u;
}

void same70_usb_detach(void)
{
	if (usb_initialized != 0u) {
		USBHS_DEVCTRL |= USBHS_DEVCTRL_DETACH;
	}
	usb_attached = 0u;
}

void same70_usb_poll(void)
{
	uint32_t ep0isr;

	if (usb_initialized == 0u) {
		return;
	}

	if ((USBHS_DEVISR & USBHS_DEVISR_EORST) != 0u) {
		usb_reset_count++;
		USBHS_DEVICR = USBHS_DEVICR_EORSTC;
		set_usb_address(0u);
		usb_configuration = 0u;
		clear_interface_alternates();
		interface_alternate_peak_mask = 0u;
		disable_audio_endpoints();
		configure_ep0();
	}

	ep0isr = USBHS_DEVEPTISR(0u);
	if ((ep0isr & USBHS_DEVEPTISR_RXSTPI) != 0u) {
		poll_setup_packet();
		return;
	}

	if (((ep0isr & USBHS_DEVEPTISR_TXINI) != 0u) && (ep0_state == EP0_STATE_TX_DATA)) {
		ep0_send_next_data();
		return;
	}

	if (((ep0isr & USBHS_DEVEPTISR_TXINI) != 0u) && (ep0_state == EP0_STATE_TX_STATUS)) {
		if (pending_address_valid != 0u) {
			set_usb_address(pending_address);
			pending_address_valid = 0u;
		}
		ep0_state = EP0_STATE_IDLE;
		return;
	}

	if ((ep0isr & USBHS_DEVEPTISR_RXOUTI) != 0u) {
		usb_rxout_count++;
		if (ep0_state == EP0_STATE_RX_DATA_STATUS) {
			handle_ep0_out_data(endpoint_byte_count(ep0isr));
		}
		USBHS_DEVEPTICR(0u) = USBHS_DEVEPTICR_RXOUTIC;
		if (ep0_state == EP0_STATE_RX_DATA_STATUS) {
			ep0_start_status_in();
		} else if (ep0_state == EP0_STATE_WAIT_OUT_STATUS) {
			ep0_state = EP0_STATE_IDLE;
			if (pending_device_reset != 0u) {
				system_reset();
			}
		}
	}

	poll_audio_endpoints();
}

void same70_usb_get_status(same70_usb_status_t *status)
{
	status->initialized = usb_initialized;
	status->attached = usb_attached;
	status->pmc_sr = PMC_SR;
	status->pmc_usb = PMC_USB;
	status->pmc_pcsr1 = PMC_PCSR1;
	status->usbhs_ctrl = USBHS_CTRL;
	status->usbhs_sr = USBHS_SR;
	status->devctrl = USBHS_DEVCTRL;
	status->devisr = USBHS_DEVISR;
	status->devept = USBHS_DEVEPT;
	status->ep0cfg = USBHS_DEVEPTCFG(0u);
	status->ep0isr = USBHS_DEVEPTISR(0u);
	status->ep0imr = USBHS_DEVEPTIMR(0u);
	status->ep3cfg = USBHS_DEVEPTCFG(USB_AUDIO_OUT_EP);
	status->ep3isr = USBHS_DEVEPTISR(USB_AUDIO_OUT_EP);
	status->ep4cfg = USBHS_DEVEPTCFG(USB_AUDIO_FB_EP);
	status->ep4isr = USBHS_DEVEPTISR(USB_AUDIO_FB_EP);
	status->ep5cfg = USBHS_DEVEPTCFG(USB_AUDIO_IN_EP);
	status->ep5isr = USBHS_DEVEPTISR(USB_AUDIO_IN_EP);
	status->reset_count = usb_reset_count;
	status->setup_count = usb_setup_count;
	status->tx_count = usb_tx_count;
	status->rxout_count = usb_rxout_count;
	status->stall_count = usb_stall_count;
	status->audio_config_count = audio_config_count;
	status->audio_cfgok_mask = audio_cfgok_mask();
	status->audio_out_count = audio_out_count;
	status->audio_out_bytes = audio_out_bytes;
	status->audio_out_last_bytes = audio_out_last_bytes;
	status->audio_out_max_bytes = audio_out_max_bytes;
	status->audio_feedback_count = audio_feedback_count;
	status->audio_feedback_bytes = audio_feedback_bytes;
	status->audio_feedback_busy_last = audio_feedback_busy_last;
	status->audio_feedback_busy_max = audio_feedback_busy_max;
	status->audio_in_count = audio_in_count;
	status->audio_in_bytes = audio_in_bytes;
	status->audio_in_busy_last = audio_in_busy_last;
	status->audio_in_busy_max = audio_in_busy_max;
	status->audio_error_count = audio_error_count;
	status->audio_short_count = audio_short_count;
	status->audio_crc_count = audio_crc_count;
	status->audio_overflow_count = audio_overflow_count;
	status->audio_underflow_count = audio_underflow_count;
	status->audio_source_mode = audio_source_mode;
	status->audio_out_format = audio_out_format;
	status->audio_in_format = audio_in_format;
	status->audio_loopback_level = audio_loopback_level;
	status->audio_loopback_peak = audio_loopback_peak;
	status->audio_loopback_drop_bytes = audio_loopback_drop_bytes;
	status->audio_loopback_silence_bytes = audio_loopback_silence_bytes;
	status->descriptor_count = usb_descriptor_count;
	status->set_address_count = usb_set_address_count;
	status->set_configuration_count = usb_set_configuration_count;
	status->set_interface_count = usb_set_interface_count;
	status->audio_set_interface_count = audio_set_interface_count;
	status->interface_alternate_mask = interface_alternate_mask();
	status->interface_alternate_peak_mask = interface_alternate_peak_mask;
	status->last_set_interface_index = last_set_interface_index;
	status->last_set_interface_value = last_set_interface_value;
	status->address = usb_address;
	status->configuration = usb_configuration;
	status->ep0_state = (uint32_t)ep0_state;
	status->last_setup0 = last_setup0;
	status->last_wvalue = last_wvalue;
	status->last_windex = last_windex;
	status->last_wlength = last_wlength;
}

uint32_t same70_usb_set_audio_source(uint32_t source)
{
	if (source > SAME70_USB_AUDIO_SOURCE_SILENCE) {
		return 0u;
	}

	audio_source_mode = source;
	reset_audio_loopback_buffer();
	reset_audio_pattern();
	return 1u;
}
